FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_GPIO.c
/*-------------------------------------------------------------------------*
 * File:  GPIO.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC1756 GPIO Interface.
 * Implementation:
 *      A single GPIO0 is created, but the code can be easily changed for
 *      other processors to use multiple GPIO busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <Source/Processor/NXP/LPC1756/LPC1756_GPIO.h>
#include <HAL/Interrupt.h>
#include <stdio.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 *iPINSELReg1;
    TVUInt32 *iPINSELReg2;
    TVUInt32 *iPINMODEReg1;
    TVUInt32 *iPINMODEReg2;
    TVUInt32 *iIOPIN;
    TVUInt32 *iIOSET;
    TVUInt32 *iIOCLR;
    TVUInt32 *iIODIR;

    // uEZ v2.02
    TVUInt32 *iPINMODE_ODReg;
    TVUInt32 *iIOIntEnR;
    TVUInt32 *iIOIntEnF;
    TVUInt32 *iIOIntStatR;
    TVUInt32 *iIOIntStatF;
    TVUInt32 *iIOIntClr;
} LPC1756_GPIO_PortInfo;

typedef struct {
    const HAL_GPIOPort *iHAL;
    const LPC1756_GPIO_PortInfo *iPortInfo;

    // uEZ v2.02
    TUInt32 iLocked;
    T_gpioInterruptHandler iInterruptCallback;
    void *iInterruptCallbackWorkspace;
} T_LPC1756_GPIO_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
const LPC1756_GPIO_PortInfo GPIO_LPC1756_Port0_PortInfo = {
    (TVUInt32 *)&PINCON->PINSEL0,
    (TVUInt32 *)&PINCON->PINSEL1,
    (TVUInt32 *)&PINCON->PINMODE0,
    (TVUInt32 *)&PINCON->PINMODE1,
    (TVUInt32 *)&GPIO0->FIOPIN,
    (TVUInt32 *)&GPIO0->FIOSET,
    (TVUInt32 *)&GPIO0->FIOCLR,
    (TVUInt32 *)&GPIO0->FIODIR,
    (TVUInt32 *)&PINCON->PINMODE_OD0,
    (TVUInt32 *)&GPIOINT->IO0IntEnR,
    (TVUInt32 *)&GPIOINT->IO0IntEnF,
    (TVUInt32 *)&GPIOINT->IO0IntStatR,
    (TVUInt32 *)&GPIOINT->IO0IntStatF,
    (TVUInt32 *)&GPIOINT->IO0IntClr,
};

const LPC1756_GPIO_PortInfo GPIO_LPC1756_Port1_PortInfo = {
    (TVUInt32 *)&PINCON->PINSEL2,
    (TVUInt32 *)&PINCON->PINSEL3,
    (TVUInt32 *)&PINCON->PINMODE2,
    (TVUInt32 *)&PINCON->PINMODE3,
    (TVUInt32 *)&GPIO1->FIOPIN,
    (TVUInt32 *)&GPIO1->FIOSET,
    (TVUInt32 *)&GPIO1->FIOCLR,
    (TVUInt32 *)&GPIO1->FIODIR,
    (TVUInt32 *)&PINCON->PINMODE_OD1,
    0,
    0,
    0,
    0,
    0,
};

const LPC1756_GPIO_PortInfo GPIO_LPC1756_Port2_PortInfo = {
    (TVUInt32 *)&PINCON->PINSEL4,
    (TVUInt32 *)&PINCON->PINSEL5,
    (TVUInt32 *)&PINCON->PINMODE4,
    (TVUInt32 *)&PINCON->PINMODE5,
    (TVUInt32 *)&GPIO2->FIOPIN,
    (TVUInt32 *)&GPIO2->FIOSET,
    (TVUInt32 *)&GPIO2->FIOCLR,
    (TVUInt32 *)&GPIO2->FIODIR,
    (TVUInt32 *)&PINCON->PINMODE_OD2,
    (TVUInt32 *)&GPIOINT->IO2IntEnR,
    (TVUInt32 *)&GPIOINT->IO2IntEnF,
    (TVUInt32 *)&GPIOINT->IO2IntStatR,
    (TVUInt32 *)&GPIOINT->IO2IntStatF,
    (TVUInt32 *)&GPIOINT->IO2IntClr,
};

const LPC1756_GPIO_PortInfo GPIO_LPC1756_Port4_PortInfo = {
    (TVUInt32 *)&PINCON->PINSEL8,
    (TVUInt32 *)&PINCON->PINSEL9,
    (TVUInt32 *)&PINCON->PINMODE8,
    (TVUInt32 *)&PINCON->PINMODE9,
    (TVUInt32 *)&GPIO4->FIOPIN,
    (TVUInt32 *)&GPIO4->FIOSET,
    (TVUInt32 *)&GPIO4->FIOCLR,
    (TVUInt32 *)&GPIO4->FIODIR,
    (TVUInt32 *)&PINCON->PINMODE_OD4,
    0,
    0,
    0,
    0,
    0,
};

static T_LPC1756_GPIO_Workspace *G_LPC1756Port0Workspace = 0;
static T_LPC1756_GPIO_Workspace *G_LPC1756Port2Workspace = 0;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
void LPC1756_GPIO_ProcessIRQ(T_LPC1756_GPIO_Workspace *p);

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_Port0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1756 GPIO Port0 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_Port0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC1756_Port0_PortInfo;
    p->iLocked = 0;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    G_LPC1756Port0Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_Port1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1756 GPIO Port1 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_Port1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC1756_Port1_PortInfo;
    p->iLocked = 0;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_Port2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1756 GPIO Port2 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_Port2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC1756_Port2_PortInfo;
    p->iLocked = 0;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    G_LPC1756Port2Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_Port4_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1756 GPIO Port4 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_Port4_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC1756_Port4_PortInfo;
    p->iLocked = 0;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are usable.
 *      DEPRECATED
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aUsablePins         -- Pins allowed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_Configure(void *aWorkspace, TUInt32 aUsablePins)
{
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aUsablePins);

