FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_GPIO.c
    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;
    if (aMux >= 4)
        return UEZ_ERROR_OUT_OF_RANGE;

    // Setup the pin connect block (pins 0-31)
    if (aPortPinIndex < 16) {
        // Pins 0-15
        shift = (aPortPinIndex<<1);
        (*p_info->iPINSELReg1) &= ~(3 << shift);
        (*p_info->iPINSELReg1) |= aMux << shift;
    } else {
        // Pins 16-31
        shift = ((aPortPinIndex-16)<<1);
        (*p_info->iPINSELReg2) &= ~(3 << shift);
        (*p_info->iPINSELReg2) |= aMux << shift;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_GetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Get pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 *      T_gpioMux aMux              -- Mux setting being used
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_GetMux(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioMux *aMux)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    const LPC1756_GPIO_PortInfo *p_info = p->iPortInfo;
    TUInt32 shift;

    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Decode the pin connect block (pins 0-31) into 2 bit pairs
    if (aPortPinIndex < 16) {
        // Pins 0-15
        shift = (aPortPinIndex<<1);
        *aMux = ((*p_info->iPINSELReg1) >> shift) & 3;
    } else {
        // Pins 16-31
        shift = ((aPortPinIndex-16)<<1);
        *aMux = ((*p_info->iPINSELReg2) >> shift) & 3;
    }

    return UEZ_ERROR_NONE;
}


T_uezError LPC1756_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    const LPC1756_GPIO_PortInfo *p_info = p->iPortInfo;

    PARAM_NOT_USED(aValue);

    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            error = UEZ_ERROR_NONE;
            break;
        case GPIO_CONTROL_ENABLE_OPEN_DRAIN:
            (*p_info->iPINMODE_ODReg) |= ~(1<<aPortPinIndex);
            break;
        case GPIO_CONTROL_DISABLE_OPEN_DRAIN:
            (*p_info->iPINMODE_ODReg) &= ~(1<<aPortPinIndex);
            break;
        case GPIO_CONTROL_SET_CONFIG_BITS:
            // Do several controls at the same time
            error = LPC1756_GPIO_SetMux(p, aPortPinIndex, aValue & 3);
            if (error)
                return error;
            error = LPC1756_GPIO_SetPull(p, aPortPinIndex,
                (T_gpioPull)((aValue >> 2) & 7));
            if (error)
                return error;
            if (aValue & IOCON_OPEN_DRAIN)
                error = LPC1756_GPIO_Control(p, aPortPinIndex,
                    GPIO_CONTROL_ENABLE_OPEN_DRAIN, 0);
            else
                error = LPC1756_GPIO_Control(p, aPortPinIndex,
                    GPIO_CONTROL_DISABLE_OPEN_DRAIN, 0);
            break;
        default:
            error = UEZ_ERROR_NOT_SUPPORTED;
            break;
    }

    return error;
}

T_uezError LPC1756_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
#ifndef NDEBUG
    char buffer [50];
#endif
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        #ifndef NDEBUG
          sprintf (buffer, "PinLock on %s Pin %d", p->iHAL->iInterface.iName, aPortPins);
          UEZFailureMsg(buffer);
        #else
          UEZFailureMsg("PinLock");
        #endif
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError LPC1756_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Interrupt Routine:  LPC1756_GPIO_IRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO interrupts have fired off, do the right one.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
static IRQ_ROUTINE(LPC1756_GPIO_IRQ)
{
    IRQ_START();

    // It's port 0 and/or port 2, is this port 0 firing?
    if (GPIOINT->IntStatus & IOIntStatus_P0Int)
        LPC1756_GPIO_ProcessIRQ(G_LPC1756Port0Workspace);
    if (GPIOINT->IntStatus & IOIntStatus_P2Int)
        LPC1756_GPIO_ProcessIRQ(G_LPC1756Port2Workspace);

    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_SetInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the GPIO's interrupt mode (enable if not already enabled)
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      T_gpioInterruptHandler iInterruptCallback -- Routine to call on
 *                                      interrupt.
 *      void *iInterruptCallbackWorkspace -- Workspace of callback
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_ConfigureInterruptCallback(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;

    // Register the interrupt handler if not already registered
    InterruptRegister(EINT3_IRQn, LPC1756_GPIO_IRQ, INTERRUPT_PRIORITY_HIGH,
            "GPIOIrq");
    InterruptEnable(EINT3_IRQn);

    p->iInterruptCallback = aInterruptCallback;
    p->iInterruptCallbackWorkspace = aInterruptCallbackWorkspace;

    return UEZ_ERROR_NONE;
}

