FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_GPIO.c
T_uezError LPC1756_GPIO_ConfigureInterruptCallback_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aInterruptCallback);PARAM_NOT_USED(aInterruptCallbackWorkspace);

    // No IRQs on these
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_ProcessIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO ports is reporting an IRQ.  This processes one
 *      of the ports for falling or rising edge events.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
void LPC1756_GPIO_ProcessIRQ(T_LPC1756_GPIO_Workspace *p)
{
    TUInt32 regF;
    TUInt32 regR;
    const LPC1756_GPIO_PortInfo *p_info = p->iPortInfo;

    // Make sure we have a handler
    if (!p->iInterruptCallback)
        InterruptFatalError();

    // Do we have any falling edge interrupts?
    regF = *(p_info->iIOIntStatF);
    regR = *(p_info->iIOIntStatR);
    if (regF)
        p->iInterruptCallback(p->iInterruptCallbackWorkspace, regF,
                GPIO_INTERRUPT_FALLING_EDGE);

    // Do we have any rising edge interrupts?
    if (regR)
        p->iInterruptCallback(p->iInterruptCallbackWorkspace, regR,
                GPIO_INTERRUPT_RISING_EDGE);

    // Now clear all the interrupts processed above
    // (regardless of enabled/disabled state)
    *(p_info->iIOIntClr) = regF | regR;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_EnableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn on the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to enable.
 *      T_gpioInterruptType aType   -- Type of interrupts to enable.
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_EnableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    const LPC1756_GPIO_PortInfo *p_info = p->iPortInfo;

    if (aType == GPIO_INTERRUPT_FALLING_EDGE)
        (*p_info->iIOIntEnF) |= (1 << (aPortPins & 0xFF));
    else if (aType == GPIO_INTERRUPT_RISING_EDGE)
        (*p_info->iIOIntEnR) |= (1 << (aPortPins & 0xFF));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_DisableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn off the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *      T_gpioInterruptType aType   -- Type of interrupts to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_DisableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    const LPC1756_GPIO_PortInfo *p_info = p->iPortInfo;

    if (aType == GPIO_INTERRUPT_FALLING_EDGE)
        (*p_info->iIOIntEnF) &= ~(1 << (aPortPins & 0xFF));
    else if (aType == GPIO_INTERRUPT_RISING_EDGE)
        (*p_info->iIOIntEnR) &= ~(1 << (aPortPins & 0xFF));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_GPIO_ClearInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear interrupts on a specific GPIO line
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC1756_GPIO_ClearInterrupts(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1756_GPIO_Workspace *p = (T_LPC1756_GPIO_Workspace *)aWorkspace;
    const LPC1756_GPIO_PortInfo *p_info = p->iPortInfo;

    (*p_info->iIOIntClr) = (1 << (aPortPins & 0xFF));

    return UEZ_ERROR_NONE;
}

T_uezError LPC1756_GPIO_EnableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC1756_GPIO_DisableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC1756_GPIO_ClearInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_LPC1756_Port0_Interface = {
    {
    "LPC1756 GPIO Port 0",
    0x0100,
    LPC1756_GPIO_Port0_InitializeWorkspace,
    sizeof(T_LPC1756_GPIO_Workspace),
    },

    LPC1756_GPIO_Configure,
    LPC1756_GPIO_Activate,
    LPC1756_GPIO_Deactivate,
    LPC1756_GPIO_SetOutputMode,
    LPC1756_GPIO_SetInputMode,
    LPC1756_GPIO_Set,
    LPC1756_GPIO_Clear,
    LPC1756_GPIO_Read,
    LPC1756_GPIO_SetPull,
    LPC1756_GPIO_SetMux,

    // uEZ v2.02
    LPC1756_GPIO_ConfigureInterruptCallback,
    LPC1756_GPIO_EnableInterrupts,
    LPC1756_GPIO_DisableInterrupts,
    LPC1756_GPIO_ClearInterrupts,
    LPC1756_GPIO_Control,
    LPC1756_GPIO_Lock,
    LPC1756_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC1756_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1756_Port1_Interface = {
    {
    "LPC1756 GPIO Port 1",
    0x0100,
    LPC1756_GPIO_Port1_InitializeWorkspace,
    sizeof(T_LPC1756_GPIO_Workspace),
    },

    LPC1756_GPIO_Configure,
    LPC1756_GPIO_Activate,
    LPC1756_GPIO_Deactivate,
    LPC1756_GPIO_SetOutputMode,
    LPC1756_GPIO_SetInputMode,
    LPC1756_GPIO_Set,
    LPC1756_GPIO_Clear,
    LPC1756_GPIO_Read,
    LPC1756_GPIO_SetPull,
    LPC1756_GPIO_SetMux,

    // uEZ v2.02
    LPC1756_GPIO_ConfigureInterruptCallback_NotSupported,
    LPC1756_GPIO_EnableInterrupts_NotSupported,
    LPC1756_GPIO_DisableInterrupts_NotSupported,
    LPC1756_GPIO_ClearInterrupts_NotSupported,
    LPC1756_GPIO_Control,
    LPC1756_GPIO_Lock,
    LPC1756_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC1756_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1756_Port2_Interface = {
    {
    "LPC1756 GPIO Port 2",
    0x0100,
    LPC1756_GPIO_Port2_InitializeWorkspace,
    sizeof(T_LPC1756_GPIO_Workspace),
    },

    LPC1756_GPIO_Configure,
    LPC1756_GPIO_Activate,
    LPC1756_GPIO_Deactivate,
    LPC1756_GPIO_SetOutputMode,
    LPC1756_GPIO_SetInputMode,
    LPC1756_GPIO_Set,
    LPC1756_GPIO_Clear,
    LPC1756_GPIO_Read,
    LPC1756_GPIO_SetPull,
    LPC1756_GPIO_SetMux,

    // uEZ v2.02
    LPC1756_GPIO_ConfigureInterruptCallback,
    LPC1756_GPIO_EnableInterrupts,
    LPC1756_GPIO_DisableInterrupts,
    LPC1756_GPIO_ClearInterrupts,
    LPC1756_GPIO_Control,
    LPC1756_GPIO_Lock,
    LPC1756_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC1756_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1756_Port4_Interface = {
    {
    "LPC1756 GPIO Port 4",
    0x0100,
    LPC1756_GPIO_Port4_InitializeWorkspace,
    sizeof(T_LPC1756_GPIO_Workspace),
    },

    LPC1756_GPIO_Configure,
    LPC1756_GPIO_Activate,
    LPC1756_GPIO_Deactivate,
    LPC1756_GPIO_SetOutputMode,
    LPC1756_GPIO_SetInputMode,
    LPC1756_GPIO_Set,
    LPC1756_GPIO_Clear,
    LPC1756_GPIO_Read,
    LPC1756_GPIO_SetPull,
    LPC1756_GPIO_SetMux,

    // uEZ v2.02
    LPC1756_GPIO_ConfigureInterruptCallback_NotSupported,
    LPC1756_GPIO_EnableInterrupts_NotSupported,
    LPC1756_GPIO_DisableInterrupts_NotSupported,
    LPC1756_GPIO_ClearInterrupts_NotSupported,
    LPC1756_GPIO_Control,
    LPC1756_GPIO_Lock,
    LPC1756_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC1756_GPIO_GetMux };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1756_GPIO0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_LPC1756_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void LPC1756_GPIO1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO1 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_LPC1756_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void LPC1756_GPIO2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO2 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_LPC1756_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

void LPC1756_GPIO4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO4 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_LPC1756_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}


/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
